name: "dwpose_ensemble"
backend: "python"
max_batch_size: 0

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "KEYPOINTS"
    data_type: TYPE_FP32
    dims: [ -1, 133, 2 ]
  },
  {
    name: "SCORES"
    data_type: TYPE_FP32
    dims: [ -1, 133 ]
  },
  {
    name: "BBOXES"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  }
]

parameters {
  key: "det_model"
  value { string_value: "yolo11m" }
}
parameters {
  key: "pose_model"
  value { string_value: "dwpose" }
}
parameters {
  key: "det_conf"
  value { string_value: "0.5" }
}
parameters {
  key: "det_iou"
  value { string_value: "0.25" }
}
parameters {
  key: "pose_score_thr"
  value { string_value: "0.6" }
}
parameters {
  key: "simcc_split_ratio"
  value { string_value: "2.0" }
}
parameters {
  key: "det_input_size"
  value { string_value: "640,640" }
}
parameters {
  key: "pose_input_size"
  value { string_value: "384,288" }
}
parameters {
  key: "det_input_dtype"
  value { string_value: "FP16" }
}

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0] 
  }
]
